Revit 2027 API
View.CropBoxVisible Property
Whether or not the Crop Box/Region is visible for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CropBoxVisible { get; set; }
Public Property CropBoxVisible As Boolean
	Get
	Set
public:
property bool CropBoxVisible {
	bool get ();
	void set (bool value);
}
member CropBoxVisible : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InapplicableDataException | Thrown when getting this property, if the view is a template and cannot have a crop box applied.
InvalidOperationException | Thrown when setting this property, if the view is a template and cannot have a crop box applied.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace